

{
    "basic_info": {
      "description_header": "Bonjour",
      "description": "Je suis Rivka Muller, diplômée titre RNCP n°32173 'Développeur Web', niveau Bac +2, à l'issue d'une formation OpenClassrooms. J'ai décidé de suivre ce parcours, suite à l'obtention du Certificat Professionnel Technicien développement applications informatique (CP16) que j'ai suivi au CNAM. Mis à part le langage Java, j'y avais appris les bases du développement web. Développeuse web, je recherche à améliorer constamment mes connaissances et suis motivée à mettre à profit mes compétences et enrichir mes expériences.",
      "section_name": {
        "about": "Un peu sur moi",
        "projects": "Projets OpenClassrooms",
        "skills": "Compétences"
      }
    },
    "projects": [
      {
        "title": "Booki, agence de voyage",
        "startDate": "2023",
        "description": "Intégrer du contenu confomément à une maquette  avec HTML & CSS tout en veillant à l'aspect responsive du site.",
        "problem":"",
        "images": [          
          "images/booki/desktop.webp",
          "images/booki/mobile.webp"
        ],
        "url": "https://rivka-dev.github.io/AgenceVoyageBooki/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      },
      {
        "title": "Sophie Buel, architecte d'intérieur",
        "startDate": "2023",
        "description": "Créer une page de connexion en html et gérer la connexion de l'utilsateur via des appels à l'API fourni. Création d'un filtre des projets dans la galerie, et création d'un modale permettant d'uploader de nouveaux médias. Le code back-end ainsi que l'Api étaient fournis. ",
        "problem":"Il fallait s'assurer que lors de la suppression d'un travail, celui-ci soit supprimé dans le DOM sans recharger la page. Après diverses recherches sur le web, j'ai utilisé la fonction remove pour supprimer tous les élements qui avaient le data-id de ce travail. Il fallait aussi s'assurer que les évenements de la souris soient ajoutés depuis le javascript et non pas intégrés dans le HTML. Il m'a donc fallu utiliser la fonction 'addEventListener'.",
        "images": [
          "images/sophieBuel/login.webp",
          "images/sophieBuel/gallerie.webp"
        ],
        "url": "https://github.com/rivka-dev/SophieBuelProjet3.git",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Menu Maker by Qwenta",
        "startDate": "2023",
        "description": "Rédiger les spécifications techniques d'un projet à partir de besoins fonctionnels, suivre le déroulement du projet grâce à un outil de gestion de projet, découper les fonctionnalités en tâches ainsi que présentation de la solution technique.",
        "images": [
          "images/qwenta/kanban.webp",
          "images/qwenta/specificationsTechniques.webp"
        ],
        "url": "https://ring-kingfisher-8ca.notion.site/da9c876ba92c4c1092b77f4bfeea3285?v=464151634dba4005993d5c3e65d2e82d",
        "technologies": [
          {
            "class": "",
            "name": ""
          }
          
        ]
      },
      {
        "title": "Nina Carducci, site de photographe",
        "startDate": "2023",
        "description": "Amélioration du site qui est déja fourni, je dois améliorer son SEO et son accessibilité ainsi que corriger des bugs.  ",
        "problem":"Il a fallu utiliser les dev-tools pour debugger et cet outil étant nouveau pour moi, celà m'a pris un peu de temps. Je suis allée pas à pas dans le code, qui redirigeait vers un long fichier javascript. Il fallait faire attention à ne pas aller trop vite sinon des étapes pouvaient être sautées. A force de perséverer, j'ai trouvé la solution au problème.",
        "images": [  
          "images/ninaCarducci/lighthouse.webp",
          "images/ninaCarducci/wave.webp"
        ],
        "url": "https://github.com/rivka-dev/nina-carducci.git",
        "technologies": [
          {
            "class": "",
            "name": ""
          }
          
        ]
        
      },
      
      {
        "title": "Kasa , agence de location",
        "startDate": "2023",
        "description": "Développer des éléments de l'interface d'un site web grâce à des composants React et configurer la navigation entre les pages de l'application avec React Router.",
        "problem":"Une fiche logement donnant les détails pour un logement spécifique devait être créée, mais je ne voyais pas comment récupéer les données d'un seul logement parmi toutes la liste json fournie. Après avoir sollicité de l'aide à d'autres étudiants ainsi que des recherches sur le web, j'ai utilisé la fonction useParams pour retrouver le id, et ensuite ai recherché celui-ci parmi tous les logements avec la fonction find. Les cartes d'images devaient aussi avoir un dégradé au dessus  et il a fallu plusieurs essais sur chrome pour découvrir qu'il fallait utiliser le css sur le sélecteur  'li &:before'.",
        "images": [
          "images/kasa/desktop.webp",
          "images/kasa/mobile.webp"
        ],
        "url": "https://rivka-dev.github.io/kasa-react",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          }
          
        ]
      },
      {
        "title": "Mon vieux Grimoire, site de notation de livres",
        "startDate": "2023",
        "description": "Réalisation du Backend du site en mettant en oeuvre des opérations CRUD et en stockant des données de manière sécurisée.  ",
        "images": [
          "images/monVieuxGrimoire/accueil.webp",
          "images/monVieuxGrimoire/notation.webp"
        ],
        "url": "https://github.com/rivka-dev/monGrimoire.git",
        "technologies": [
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          },
          
          {
            "class": "devicon-nodejs-plain",
            "name": "NodeJS"
          },
          {
            "class": "devicon-express-original",
            "name": "ExpressJS"
          }
          
        ]
      }
    ]
    
    
  }